DataProcessors/Renault_ПоискЗаменаРеферансовПриПоступлении.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_ПоискЗаменаРеферансовПриПоступлении</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поступление</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ЗаказыРаспределение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыРаспределение</Name>
			<Comment>Хранит состояние распределения ожидаемых заказов поставщиков, покупателей и подразделений</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество распределенной номенклатуры</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Comment>Заказ, под который распределен заказ поставщика</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРемонт</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказВнутренний</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказIT</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщика</Name>
					<Comment>Заказ поставщику, на который распределены заказы покупателей</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказВнутренний</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщикуIT</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура распределяемых заказов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры распределяемых заказов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЗаказыПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПоставщикам</Name>
			<Comment>Заказы поставщикам</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заказано</Name>
					<Comment>Количество номенклатуры по заказу</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма заказанной номенклатуры в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма заказанной номенклатуры в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик заказа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Comment>Документ оформления заказа</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщикуIT</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура заказа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры заказа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/Renault_КаталогРеферансов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_КаталогРеферансов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Comment>Наименование номенклатуры</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КратностьПоставок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапретЗакупки</Name>
					<Comment>Запрет закупки номенклатуры</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТехСемья</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Нетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Брутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Габариты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_Сегменты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаличиеВSAPе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрямаяПоставка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодоваяЗапчасть</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PVI</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыPVI</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодСкидки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентПоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйАртикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Артикул</Name>
					<Comment>№ по каталогу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ЗаменыРеферансов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ЗаменыРеферансов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АртикулНоменклатуры</Name>
					<Comment>№ по каталогу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АртикулЗамены</Name>
					<Comment>№ по каталогу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/Renault_ПоискЗаменаРеферансовПриПоступлении/Ext/ObjectModule.bsl
Перем ИзмДок;
Перем ТаблицаЗаменено;
Перем ДокПоступлениеОб;
Перем ИнформацияПользователю;

Функция ОбновитьДанные(Дерево) Экспорт

	ИнформацияПользователю = "";
	
	Дерево.Строки.Очистить();
	
	Запрос = Новый Запрос;
	
	СтруктураКлючи = ПолучитьКлючиСвязиНоменклатуры();
	
	ТаблицаЗамены = СтруктураКлючи.ТаблицаЗамены;
	
	Запрос.УстановитьПараметр("Ссылка", Поступление);
	Запрос.УстановитьПараметр("КлючиСвязиНоменклатуры", СтруктураКлючи.ТаблицаСвязи);
	Запрос.УстановитьПараметр("Момент",?(НачалоДня(Поступление.Дата) = НачалоДня(ТекущаяДата()), Неопределено, Поступление.МоментВремени()));
	Запрос.Текст = ТекстЗапросаЗамены();

	Результат = Запрос.ВыполнитьПакет();
	//Результат[Результат.Количество()-3].Выгрузить();
	ВыборкаНераспределено = Результат[Результат.Количество()-2].Выбрать();
	ВыборкаОстаткиПоЗаказам = Результат[Результат.Количество()-1].Выбрать();
	
	Пока ВыборкаНераспределено.Следующий() Цикл
		
		СтрокаДерева0 = Дерево.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДерева0, ВыборкаНераспределено);
		
		ВыборкаОстаткиПоЗаказам.Сбросить();
		Пока ВыборкаОстаткиПоЗаказам.НайтиСледующий(ВыборкаНераспределено.Ключ, "Ключ") Цикл
			Если ВыборкаОстаткиПоЗаказам.Номенклатура = СтрокаДерева0.Номенклатура Тогда Продолжить; КонецЕсли;
			
			Если ТаблицаЗамены.НайтиСтроки(Новый Структура("Артикул, АртикулЗамены", ВыборкаНераспределено.Реферанс, ВыборкаОстаткиПоЗаказам.Реферанс)).Количество() <> 0 Тогда
				ВидЗамены = "Замены реферансов";
			Иначе
				ВидЗамены = "По сегменту и тех. семье";
			КонецЕсли;
			
			КолР = ВыборкаОстаткиПоЗаказам.КоличествоРаспределить;
			КолД = ВыборкаОстаткиПоЗаказам.ДоступноРаспределение;
			Количество = ?(КолР > КолД, КолД, КолР);
			Если Количество = 0 Тогда Продолжить; КонецЕсли;
			
			СтрокаДерева1 = СтрокаДерева0.Строки.Добавить();
			СтрокаДерева1.Количество = Количество / ВыборкаОстаткиПоЗаказам.Коэффициент;
			СтрокаДерева1.ВидЗамены = ВидЗамены;
			ЗаполнитьЗначенияСвойств(СтрокаДерева1, ВыборкаОстаткиПоЗаказам);
			
		КонецЦикла;
		
		// Если нет возможных замен, то не показываем такую строку пользователю
		Если СтрокаДерева0.Строки.Количество() = 0 Тогда Дерево.Строки.Удалить(СтрокаДерева0) КонецЕсли;
		
		СтрокаДерева0.Строки.Сортировать("ВидЗамены, ЗаказПоставщику");
		
	КонецЦикла;

	Возврат Новый Структура("Дерево, Информация", Дерево, ИнформацияПользователю);
	
КонецФункции

Функция ПолучитьКлючиСвязиНоменклатуры()

	Перем ТаблицаСвязи;
	
	ИнициализироватьТаблицуСвязи(ТаблицаСвязи);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", Поступление);
	
	Запрос.Текст = ТекстЗапросаКлючиСвязиНоменклатуры();
	
	Отбор = Новый Структура("Артикул");
	
	ТаблицаЗамены = Новый ТаблицаЗначений;
	ТаблицаЗамены.Колонки.Добавить("Номенклатура");
	ТаблицаЗамены.Колонки.Добавить("Артикул");
	ТаблицаЗамены.Колонки.Добавить("АртикулЗамены");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		// Таблица используется для определения вида связи (через замены или через сегмент+семья)
		Если Выборка.Приоритет = 0 Тогда
			СтрокаЗамены = ТаблицаЗамены.Добавить();
			СтрокаЗамены.Артикул       = Выборка.Артикул;
			СтрокаЗамены.АртикулЗамены = Выборка.АртикулСвязанный;
			
			СтрокаЗамены = ТаблицаЗамены.Добавить();
			СтрокаЗамены.Артикул       = Выборка.АртикулСвязанный;
			СтрокаЗамены.АртикулЗамены = Выборка.Артикул;
		КонецЕсли;
		
		// Одним ключем объеденены все замены
		
		Отбор.Вставить("Артикул", Выборка.Артикул);
		
		Найдено = ТаблицаСвязи.НайтиСтроки(Отбор);
		ПродолжитьПоиск = ?(Найдено.Количество() = 0, Истина, Ложь);
		
		Если ПродолжитьПоиск Тогда
			
			Отбор.Вставить("Артикул", Выборка.АртикулСвязанный);
			Найдено = ТаблицаСвязи.НайтиСтроки(Отбор);
			Если Найдено.Количество() = 0 Тогда
				
				// Добавляем новый ключ связи
				
				НовыйКлюч = СтрЗаменить("Key"+Строка(Новый УникальныйИдентификатор), "-", "");
				
				НС = ТаблицаСвязи.Добавить();	
				НС.Ключ = НовыйКлюч;
				НС.Артикул = Выборка.Артикул;
				
				НС = ТаблицаСвязи.Добавить();	
				НС.Ключ = НовыйКлюч;
				НС.Артикул = Выборка.АртикулСвязанный;
				
			Иначе
				
				// Используем существующий ключ
				
				НС = ТаблицаСвязи.Добавить();	
				НС.Ключ = Найдено[0].Ключ;
				НС.Артикул = Выборка.Артикул;
				
			КонецЕсли;
			
		Иначе
			НС = ТаблицаСвязи.Добавить();	
			НС.Ключ = Найдено[0].Ключ;
			НС.Артикул = Выборка.АртикулСвязанный;
		КонецЕсли;
	
	КонецЦикла;
	
	ТаблицаСвязи.Свернуть("Ключ, Артикул");
	
	Возврат Новый Структура("ТаблицаСвязи, ТаблицаЗамены", ТаблицаСвязи, ТаблицаЗамены);

КонецФункции

Функция ИнициализироватьТаблицуСвязи(ТаблицаЗамен)

	ТаблицаЗамен = Новый ТаблицаЗначений;
	ТаблицаЗамен.Колонки.Добавить("Ключ", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(36)));
	ТаблицаЗамен.Колонки.Добавить("Артикул", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(50)));
	//ТаблицаЗамен.Колонки.Добавить("Приоритет", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(1)));

КонецФункции // ИнициализироватьТаблицуЗамен()

Функция ТекстЗапросаЗамены()

	Возврат		   "ВЫБРАТЬ
	       		   |	КлючиСвязиНоменклатуры.Ключ,
	       		   |	КлючиСвязиНоменклатуры.Артикул
	       		   |ПОМЕСТИТЬ ВТ_КлючиСвязиНоменклатуры
	       		   |ИЗ
	       		   |	&КлючиСвязиНоменклатуры КАК КлючиСвязиНоменклатуры
	       		   |;
	       		   |
	       		   |////////////////////////////////////////////////////////////////////////////////
	       		   |ВЫБРАТЬ
	       		   |	ПоступлениеТоваров.Ссылка КАК ДокПоступление,
	       		   |	ПоступлениеТоваров.Организация,
	       		   |	ПоступлениеТоваров.ПодразделениеКомпании,
	       		   |	ВЫБОР
	       		   |		КОГДА ПоступлениеТоваров.ДокументОснование ССЫЛКА Документ.ЗаказПоставщику
	       		   |			ТОГДА ВЫРАЗИТЬ(ПоступлениеТоваров.ДокументОснование КАК Документ.ЗаказПоставщику)
	       		   |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	       		   |	КОНЕЦ КАК ЗаказОснование
	       		   |ПОМЕСТИТЬ ВТ_РеквизитыПоступления
	       		   |ИЗ
	       		   |	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	       		   |ГДЕ
	       		   |	ПоступлениеТоваров.Ссылка = &Ссылка
	       		   |;
	       		   |
	       		   |////////////////////////////////////////////////////////////////////////////////
	       		   |ВЫБРАТЬ
	       		   |	ПоступлениеТоваровРаспределениеТовара.ЗаказПоставщика,
	       		   |	ПоступлениеТоваровРаспределениеТовара.ЗаказПокупателя,
	       		   |	ПоступлениеТоваровРаспределениеТовара.Номенклатура,
	       		   |	СУММА(ПоступлениеТоваровРаспределениеТовара.Количество) КАК Количество
	       		   |ПОМЕСТИТЬ ВТ_РаспределеноДетально
	       		   |ИЗ
	       		   |	Документ.ПоступлениеТоваров.РаспределениеТовара КАК ПоступлениеТоваровРаспределениеТовара
	       		   |ГДЕ
	       		   |	ПоступлениеТоваровРаспределениеТовара.Ссылка = &Ссылка
	       		   |
	       		   |СГРУППИРОВАТЬ ПО
	       		   |	ПоступлениеТоваровРаспределениеТовара.ЗаказПоставщика,
	       		   |	ПоступлениеТоваровРаспределениеТовара.Номенклатура,
	       		   |	ПоступлениеТоваровРаспределениеТовара.ЗаказПокупателя
	       		   |;
	       		   |
	       		   |////////////////////////////////////////////////////////////////////////////////
	       		   |ВЫБРАТЬ
	       		   |	ВТ_РаспределеноДетально.ЗаказПоставщика,
	       		   |	ВТ_РаспределеноДетально.Номенклатура,
	       		   |	СУММА(ВТ_РаспределеноДетально.Количество) КАК Количество
	       		   |ПОМЕСТИТЬ ВТ_Распределено
	       		   |ИЗ
	       		   |	ВТ_РаспределеноДетально КАК ВТ_РаспределеноДетально
	       		   |
	       		   |СГРУППИРОВАТЬ ПО
	       		   |	ВТ_РаспределеноДетально.ЗаказПоставщика,
	       		   |	ВТ_РаспределеноДетально.Номенклатура
	       		   |;
	       		   |
	       		   |////////////////////////////////////////////////////////////////////////////////
	       		   |ВЫБРАТЬ
	       		   |	ПоступлениеТоваровТовары.Номенклатура,
	       		   |	СУММА(ПоступлениеТоваровТовары.КоличествоБазовое) КАК Количество
	       		   |ПОМЕСТИТЬ ВТ_Распределить
	       		   |ИЗ
	       		   |	Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
	       		   |ГДЕ
	       		   |	ПоступлениеТоваровТовары.Ссылка = &Ссылка
	       		   |
	       		   |СГРУППИРОВАТЬ ПО
	       		   |	ПоступлениеТоваровТовары.Номенклатура
	       		   |;
	       		   |
	       		   |////////////////////////////////////////////////////////////////////////////////
	       		   |ВЫБРАТЬ
	       		   |	СпрНоменклатура.Ссылка
	       		   |ПОМЕСТИТЬ ВТ_СписокНоменклатуры
	       		   |ИЗ
	       		   |	ВТ_Распределить КАК ВТ_Распределить
	       		   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КлючиСвязиНоменклатуры КАК ВТ_КлючиСвязиНоменклатуры
	       		   |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КлючиСвязиНоменклатуры КАК ВТ_КлючиСвязиНоменклатуры1
	       		   |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	       		   |				ПО ВТ_КлючиСвязиНоменклатуры1.Артикул = СпрНоменклатура.Артикул
	       		   |			ПО ВТ_КлючиСвязиНоменклатуры.Ключ = ВТ_КлючиСвязиНоменклатуры1.Ключ
	       		   |		ПО ВТ_Распределить.Номенклатура.Артикул = ВТ_КлючиСвязиНоменклатуры.Артикул
	       		   |
	       		   |СГРУППИРОВАТЬ ПО
	       		   |	СпрНоменклатура.Ссылка
	       		   |;
	       		   |
	       		   |////////////////////////////////////////////////////////////////////////////////
	       		   |ВЫБРАТЬ
	       		   |	ЗаказыРаспределениеОстатки.ЗаказПоставщика,
	       		   |	ЗаказыРаспределениеОстатки.Номенклатура,
	       		   |	СУММА(ЗаказыРаспределениеОстатки.КоличествоОстаток - ЕСТЬNULL(ВТ_РаспределеноДетально.Количество, 0)) КАК ОстатокРаспределение
	       		   |ПОМЕСТИТЬ ВТ_ОстаткиРаспределение
	       		   |ИЗ
	       		   |	РегистрНакопления.ЗаказыРаспределение.Остатки(
	       		   |			&Момент,
	       		   |			ЗаказПоставщика ССЫЛКА Документ.ЗаказПоставщику
	       		   |				И (ЗаказПоставщика.Организация, ЗаказПоставщика.ПодразделениеКомпании) В
	       		   |					(ВЫБРАТЬ
	       		   |						ВТ_РеквизитыПоступления.Организация,
	       		   |						ВТ_РеквизитыПоступления.ПодразделениеКомпании
	       		   |					ИЗ
	       		   |						ВТ_РеквизитыПоступления КАК ВТ_РеквизитыПоступления)
	       		   |				И Номенклатура В
	       		   |					(ВЫБРАТЬ
	       		   |						ВТ_СписокНоменклатуры.Ссылка
	       		   |					ИЗ
	       		   |						ВТ_СписокНоменклатуры КАК ВТ_СписокНоменклатуры)) КАК ЗаказыРаспределениеОстатки
	       		   |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределеноДетально КАК ВТ_РаспределеноДетально
	       		   |		ПО ЗаказыРаспределениеОстатки.ЗаказПокупателя = ВТ_РаспределеноДетально.ЗаказПокупателя
	       		   |			И ЗаказыРаспределениеОстатки.ЗаказПоставщика = ВТ_РаспределеноДетально.ЗаказПоставщика
	       		   |			И ЗаказыРаспределениеОстатки.Номенклатура = ВТ_РаспределеноДетально.Номенклатура
	       		   |
	       		   |СГРУППИРОВАТЬ ПО
	       		   |	ЗаказыРаспределениеОстатки.ЗаказПоставщика,
	       		   |	ЗаказыРаспределениеОстатки.Номенклатура
	       		   |;
	       		   |
	       		   |////////////////////////////////////////////////////////////////////////////////
	       		   |ВЫБРАТЬ
	       		   |	ЗаказыПоставщикамОстатки.ЗаказПоставщику,
	       		   |	ЗаказыПоставщикамОстатки.Номенклатура,
	       		   |	ЗаказыПоставщикамОстатки.ЗаказаноОстаток - ЕСТЬNULL(ВТ_Распределено.Количество, 0) КАК Остаток
	       		   |ПОМЕСТИТЬ ВТ_ОстаткиПоЗаказам
	       		   |ИЗ
	       		   |	РегистрНакопления.ЗаказыПоставщикам.Остатки(
	       		   |			&Момент,
	       		   |			(ЗаказПоставщику.Организация, ЗаказПоставщику.ПодразделениеКомпании) В
	       		   |					(ВЫБРАТЬ
	       		   |						ВТ_РеквизитыПоступления.Организация,
	       		   |						ВТ_РеквизитыПоступления.ПодразделениеКомпании
	       		   |					ИЗ
	       		   |						ВТ_РеквизитыПоступления КАК ВТ_РеквизитыПоступления)
	       		   |				И Номенклатура В
	       		   |					(ВЫБРАТЬ
	       		   |						ВТ_СписокНоменклатуры.Ссылка
	       		   |					ИЗ
	       		   |						ВТ_СписокНоменклатуры КАК ВТ_СписокНоменклатуры)) КАК ЗаказыПоставщикамОстатки
	       		   |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Распределено КАК ВТ_Распределено
	       		   |		ПО ЗаказыПоставщикамОстатки.ЗаказПоставщику = ВТ_Распределено.ЗаказПоставщика
	       		   |			И ЗаказыПоставщикамОстатки.Номенклатура = ВТ_Распределено.Номенклатура
	       		   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СписокНоменклатуры КАК ВТ_СписокНоменклатуры
	       		   |		ПО ЗаказыПоставщикамОстатки.Номенклатура = ВТ_СписокНоменклатуры.Ссылка
	       		   |;
	       		   |
	       		   |////////////////////////////////////////////////////////////////////////////////
	       		   |ВЫБРАТЬ
	       		   |	ВТ_ОстаткиПоЗаказам.Номенклатура,
	       		   |	СУММА(ВТ_ОстаткиПоЗаказам.Остаток) КАК Остаток
	       		   |ПОМЕСТИТЬ ВТ_ОстаткиПоЗаказамБезЗаказаОснования
	       		   |ИЗ
	       		   |	ВТ_ОстаткиПоЗаказам КАК ВТ_ОстаткиПоЗаказам
	       		   |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеквизитыПоступления КАК ВТ_РеквизитыПоступления
	       		   |		ПО ВТ_ОстаткиПоЗаказам.ЗаказПоставщику = ВТ_РеквизитыПоступления.ЗаказОснование
	       		   |ГДЕ
	       		   |	ВТ_РеквизитыПоступления.ЗаказОснование ЕСТЬ NULL 
	       		   |
	       		   |СГРУППИРОВАТЬ ПО
	       		   |	ВТ_ОстаткиПоЗаказам.Номенклатура
	       		   |;
	       		   |
	       		   |////////////////////////////////////////////////////////////////////////////////
	       		   |ВЫБРАТЬ
	       		   |	ВТ_Распределить.Номенклатура КАК Номенклатура,
	       		   |	ВЫБОР
	       		   |		КОГДА ВТ_Распределить.Количество - ЕСТЬNULL(ВТ_ОстаткиПоЗаказам.Остаток, 0) - ЕСТЬNULL(Распределено.Количество, 0) < 0
	       		   |			ТОГДА ВТ_Распределить.Количество
	       		   |		ИНАЧЕ ЕСТЬNULL(ВТ_ОстаткиПоЗаказам.Остаток, 0) + ЕСТЬNULL(Распределено.Количество, 0)
	       		   |	КОНЕЦ КАК Распределено,
	       		   |	ВЫБОР
	       		   |		КОГДА ВТ_Распределить.Количество - ЕСТЬNULL(ВТ_ОстаткиПоЗаказам.Остаток, 0) - ЕСТЬNULL(Распределено.Количество, 0) < 0
	       		   |			ТОГДА 0
	       		   |		ИНАЧЕ ВТ_Распределить.Количество - ЕСТЬNULL(ВТ_ОстаткиПоЗаказам.Остаток, 0) - ЕСТЬNULL(Распределено.Количество, 0)
	       		   |	КОНЕЦ КАК ОсталосьРаспределить,
	       		   |	ВЫБОР
	       		   |		КОГДА ВТ_Распределить.Количество - ЕСТЬNULL(Распределено.Количество, 0) > 0
	       		   |			ТОГДА ВЫБОР
	       		   |					КОГДА ВТ_Распределить.Количество - ЕСТЬNULL(Распределено.Количество, 0) - ЕСТЬNULL(ВТ_ОстаткиПоЗаказам.Остаток, 0) >= 0
	       		   |						ТОГДА ЕСТЬNULL(ВТ_ОстаткиПоЗаказам.Остаток, 0)
	       		   |					ИНАЧЕ ЕСТЬNULL(ВТ_ОстаткиПоЗаказам.Остаток, 0) - (ВТ_Распределить.Количество - ЕСТЬNULL(Распределено.Количество, 0))
	       		   |				КОНЕЦ
	       		   |		ИНАЧЕ 0
	       		   |	КОНЕЦ КАК РаспределеноИзОстатков,
	       		   |	ЕСТЬNULL(ВТ_ОстаткиПоЗаказамБезЗаказаОснования.Остаток, 0) КАК ОстатокПоЗаказамПост
	       		   |ПОМЕСТИТЬ ВТ_Номенклатура
	       		   |ИЗ
	       		   |	ВТ_Распределить КАК ВТ_Распределить
	       		   |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	       		   |			ВТ_Распределено.Номенклатура КАК Номенклатура,
	       		   |			СУММА(ВТ_Распределено.Количество) КАК Количество
	       		   |		ИЗ
	       		   |			ВТ_Распределено КАК ВТ_Распределено
	       		   |		
	       		   |		СГРУППИРОВАТЬ ПО
	       		   |			ВТ_Распределено.Номенклатура) КАК Распределено
	       		   |		ПО ВТ_Распределить.Номенклатура = Распределено.Номенклатура
	       		   |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеквизитыПоступления КАК ВТ_РеквизитыПоступления
	       		   |		ПО (ИСТИНА)
	       		   |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиПоЗаказам КАК ВТ_ОстаткиПоЗаказам
	       		   |		ПО ВТ_Распределить.Номенклатура = ВТ_ОстаткиПоЗаказам.Номенклатура
	       		   |			И (ВТ_РеквизитыПоступления.ЗаказОснование = ВТ_ОстаткиПоЗаказам.ЗаказПоставщику)
	       		   |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиПоЗаказамБезЗаказаОснования КАК ВТ_ОстаткиПоЗаказамБезЗаказаОснования
	       		   |		ПО ВТ_Распределить.Номенклатура = ВТ_ОстаткиПоЗаказамБезЗаказаОснования.Номенклатура
	       		   |
	       		   |ИНДЕКСИРОВАТЬ ПО
	       		   |	Номенклатура
	       		   |;
	       		   |
	       		   |////////////////////////////////////////////////////////////////////////////////
	       		   |ВЫБРАТЬ
	       		   |	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	       		   |	ВЫБОР
	       		   |		КОГДА ЕдиницыИзмерения.Коэффициент ЕСТЬ NULL 
	       		   |				ИЛИ ЕдиницыИзмерения.Коэффициент = 0
	       		   |			ТОГДА ВТ_Номенклатура.ОсталосьРаспределить
	       		   |		ИНАЧЕ ВТ_Номенклатура.ОсталосьРаспределить / ЕдиницыИзмерения.Коэффициент
	       		   |	КОНЕЦ КАК Количество,
	       		   |	ВТ_Номенклатура.Номенклатура.Артикул КАК Реферанс,
	       		   |	ВТ_Номенклатура.Номенклатура.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	       		   |	ВТ_КлючиСвязиНоменклатуры.Ключ,
	       		   |	ВЫБОР
	       		   |		КОГДА ЕдиницыИзмерения.Коэффициент ЕСТЬ NULL 
	       		   |				ИЛИ ЕдиницыИзмерения.Коэффициент = 0
	       		   |			ТОГДА ВТ_Номенклатура.ОстатокПоЗаказамПост
	       		   |		ИНАЧЕ ВТ_Номенклатура.ОстатокПоЗаказамПост / ЕдиницыИзмерения.Коэффициент
	       		   |	КОНЕЦ КАК ОстатокЗаказы
	       		   |ИЗ
	       		   |	ВТ_Номенклатура КАК ВТ_Номенклатура
	       		   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	       		   |		ПО ВТ_Номенклатура.Номенклатура = СпрНоменклатура.Ссылка
	       		   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КлючиСвязиНоменклатуры КАК ВТ_КлючиСвязиНоменклатуры
	       		   |		ПО (ВТ_КлючиСвязиНоменклатуры.Артикул = СпрНоменклатура.Артикул)
	       		   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	       		   |		ПО (СпрНоменклатура.ОсновнаяЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка)
	       		   |ГДЕ
	       		   |	ВТ_Номенклатура.ОсталосьРаспределить > 0
	       		   |
	       		   |УПОРЯДОЧИТЬ ПО
	       		   |	Номенклатура
	       		   |;
	       		   |
	       		   |////////////////////////////////////////////////////////////////////////////////
	       		   |ВЫБРАТЬ
	       		   |	ВТ_ОстаткиПоЗаказам.ЗаказПоставщику КАК ЗаказПоставщику,
	       		   |	ВТ_ОстаткиПоЗаказам.Номенклатура КАК Номенклатура,
	       		   |	ВТ_ОстаткиПоЗаказам.Номенклатура.Артикул КАК Реферанс,
	       		   |	ВТ_ОстаткиПоЗаказам.Номенклатура.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	       		   |	ВТ_КлючиСвязиНоменклатуры.Ключ,
	       		   |	ВЫБОР
	       		   |		КОГДА НЕ ВТ_РеквизитыПоступления.ЗаказОснование ЕСТЬ NULL 
	       		   |			ТОГДА ВТ_ОстаткиПоЗаказам.Остаток - ЕСТЬNULL(ВТ_Номенклатура.РаспределеноИзОстатков, 0)
	       		   |		ИНАЧЕ ВТ_ОстаткиПоЗаказам.Остаток
	       		   |	КОНЕЦ КАК КоличествоРаспределить,
	       		   |	ВЫБОР
	       		   |		КОГДА ВТ_ОстаткиРаспределение.ОстатокРаспределение ЕСТЬ NULL 
	       		   |			ТОГДА 0
	       		   |		ИНАЧЕ ВТ_ОстаткиРаспределение.ОстатокРаспределение - ВЫБОР
	       		   |				КОГДА НЕ ВТ_РеквизитыПоступления.ЗаказОснование ЕСТЬ NULL 
	       		   |					ТОГДА ЕСТЬNULL(ВТ_Номенклатура.РаспределеноИзОстатков, 0)
	       		   |				ИНАЧЕ 0
	       		   |			КОНЕЦ
	       		   |	КОНЕЦ КАК ДоступноРаспределение,
	       		   |	ВЫБОР
	       		   |		КОГДА ЕдиницыИзмерения.Коэффициент = 0
	       		   |			ТОГДА 1
	       		   |		ИНАЧЕ ЕСТЬNULL(ЕдиницыИзмерения.Коэффициент, 1)
	       		   |	КОНЕЦ КАК Коэффициент
	       		   |ИЗ
	       		   |	ВТ_ОстаткиПоЗаказам КАК ВТ_ОстаткиПоЗаказам
	       		   |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	       		   |		ПО ВТ_ОстаткиПоЗаказам.Номенклатура = ВТ_Номенклатура.Номенклатура
	       		   |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеквизитыПоступления КАК ВТ_РеквизитыПоступления
	       		   |		ПО ВТ_ОстаткиПоЗаказам.ЗаказПоставщику = ВТ_РеквизитыПоступления.ЗаказОснование
	       		   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	       		   |		ПО ВТ_ОстаткиПоЗаказам.Номенклатура = СпрНоменклатура.Ссылка
	       		   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КлючиСвязиНоменклатуры КАК ВТ_КлючиСвязиНоменклатуры
	       		   |		ПО (ВТ_КлючиСвязиНоменклатуры.Артикул = СпрНоменклатура.Артикул)
	       		   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	       		   |		ПО (СпрНоменклатура.ОсновнаяЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка)
	       		   |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиРаспределение КАК ВТ_ОстаткиРаспределение
	       		   |		ПО ВТ_ОстаткиПоЗаказам.ЗаказПоставщику = ВТ_ОстаткиРаспределение.ЗаказПоставщика
	       		   |			И ВТ_ОстаткиПоЗаказам.Номенклатура = ВТ_ОстаткиРаспределение.Номенклатура
	       		   |
	       		   |УПОРЯДОЧИТЬ ПО
	       		   |	Номенклатура,
	       		   |	ЗаказПоставщику
	       		   |АВТОУПОРЯДОЧИВАНИЕ";
КонецФункции 

Функция ТекстЗапросаКлючиСвязиНоменклатуры()

	Возврат
				   "ВЫБРАТЬ
	               |	ПоступлениеТоваровТовары.Номенклатура,
	               |	ПоступлениеТоваровТовары.Номенклатура.Артикул КАК Артикул
	               |ПОМЕСТИТЬ ВТ_Товары
	               |ИЗ
	               |	Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
	               |ГДЕ
	               |	ПоступлениеТоваровТовары.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеТоваровТовары.Номенклатура,
	               |	ПоступлениеТоваровТовары.Номенклатура.Артикул
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Товары.Номенклатура,
	               |	Renault_КаталогРеферансов.ТехСемья,
	               |	Renault_КаталогРеферансов.Сегмент,
	               |	ВТ_Товары.Артикул
	               |ПОМЕСТИТЬ ВТ_ТоварыПоступление
	               |ИЗ
	               |	ВТ_Товары КАК ВТ_Товары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КаталогРеферансов КАК Renault_КаталогРеферансов
	               |		ПО ВТ_Товары.Артикул = Renault_КаталогРеферансов.Артикул
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СпрНоменклатура.Ссылка КАК Номенклатура,
	               |	СпрНоменклатура.Артикул,
	               |	Renault_ЗаменыРеферансов.АртикулЗамены КАК АртикулСвязанный
	               |ПОМЕСТИТЬ ВТ_Замены
	               |ИЗ
	               |	Справочник.Номенклатура КАК СпрНоменклатура
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ЗаменыРеферансов КАК Renault_ЗаменыРеферансов
	               |		ПО СпрНоменклатура.Артикул = Renault_ЗаменыРеферансов.АртикулНоменклатуры
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СпрНоменклатура.Ссылка,
	               |	СпрНоменклатура.Артикул,
	               |	Renault_ЗаменыРеферансов.АртикулНоменклатуры
	               |ИЗ
	               |	Справочник.Номенклатура КАК СпрНоменклатура
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ЗаменыРеферансов КАК Renault_ЗаменыРеферансов
	               |		ПО СпрНоменклатура.Артикул = Renault_ЗаменыРеферансов.АртикулЗамены
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТоварыПоступление.Номенклатура,
	               |	ВТ_ТоварыПоступление.Артикул,
	               |	спрНоменклатура.Артикул КАК АртикулСвязанный,
	               |	1 КАК Приоритет
	               |ИЗ
	               |	ВТ_ТоварыПоступление КАК ВТ_ТоварыПоступление
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Renault_КаталогРеферансов КАК Renault_КаталогРеферансов
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
	               |			ПО Renault_КаталогРеферансов.Артикул = спрНоменклатура.Артикул
	               |		ПО ВТ_ТоварыПоступление.Сегмент = Renault_КаталогРеферансов.Сегмент
	               |			И ВТ_ТоварыПоступление.ТехСемья = Renault_КаталогРеферансов.ТехСемья
	               |			И ВТ_ТоварыПоступление.Артикул <> Renault_КаталогРеферансов.Артикул
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_Замены.Номенклатура,
	               |	ВТ_Замены.Артикул,
	               |	ВТ_Замены.АртикулСвязанный,
	               |	0
	               |ИЗ
	               |	ВТ_Замены КАК ВТ_Замены
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Приоритет";

КонецФункции

Функция Заменить(Дерево) Экспорт
	
	ИнформацияПользователю = ""; 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДокПоступлениеОб = Поступление.ПолучитьОбъект();
	
	ТЗ = ДеревоВТЗ(Дерево); // дерево в таблицу значений
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Таблица", ТЗ);
	Запрос.УстановитьПараметр("Момент",?(НачалоДня(ДокПоступлениеОб.Дата) = НачалоДня(ТекущаяДата()), Неопределено, Поступление.МоментВремени()));
	Запрос.Текст = ТекстЗапросаЗаменить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	ТекЗаказПокупателя = Неопределено; ТекЗаказПоставщику = Неопределено; ТекЗаказНаряд = Неопределено;
	ПЦ = Истина; 
	ИзмДок = Новый ТаблицаЗначений;
	ИзмДок.Колонки.Добавить("Приоритет"); // 0 - минимальный
	ИзмДок.Колонки.Добавить("Документ");
	ИзмДок.Колонки.Добавить("ДокументСсылка");
	
	Пока Выборка.Следующий() Цикл
		
		Если ПЦ Тогда // первый цикл
			ТекЗаказПокупателя = Выборка.ЗаказПокупателя.ПолучитьОбъект();
			ДобавитьВТаблицуИзмДок(Выборка.ЗаказПокупателя, ТекЗаказПокупателя);
			
			ТекЗаказПоставщику = Выборка.ЗаказПоставщику.ПолучитьОбъект();
			ДобавитьВТаблицуИзмДок(Выборка.ЗаказПоставщику, ТекЗаказПоставщику);
			
			ТекЗаказНаряд = Выборка.ЗаказНаряд;
			ДобавитьВТаблицуИзмДок(Выборка.ЗаказНаряд, ПолучитьОбъектЗаказНаряда(Выборка.ЗаказНаряд));
			
			ПЦ = Ложь;
		КонецЕсли;
		
		Если Выборка.ЗаказПокупателя <> ТекЗаказПокупателя.Ссылка Тогда
			ТекЗаказПокупателя = Выборка.ЗаказПокупателя.ПолучитьОбъект();
			Если ИзмДок.Найти(Выборка.ЗаказПокупателя, "ДокументСсылка")  = Неопределено Тогда ДобавитьВТаблицуИзмДок(Выборка.ЗаказПокупателя, ТекЗаказПокупателя); КонецЕсли;
		КонецЕсли;
		Если Выборка.ЗаказПоставщику <> ТекЗаказПоставщику.Ссылка Тогда
			ТекЗаказПоставщику = Выборка.ЗаказПоставщику.ПолучитьОбъект();
			Если ИзмДок.Найти(Выборка.ЗаказПоставщику, "ДокументСсылка") = Неопределено Тогда ДобавитьВТаблицуИзмДок(Выборка.ЗаказПоставщику, ТекЗаказПоставщику); КонецЕсли;
		КонецЕсли;
		Если Выборка.ЗаказНаряд <> ТекЗаказНаряд Тогда
			ТекЗаказНаряд = Выборка.ЗаказНаряд;
			
			обЗаказНаряд = ПолучитьОбъектЗаказНаряда(Выборка.ЗаказНаряд);
			Если обЗаказНаряд <> Неопределено И ИзмДок.Найти(Выборка.ЗаказНаряд, "ДокументСсылка")  = Неопределено Тогда ДобавитьВТаблицуИзмДок(Выборка.ЗаказНаряд, обЗаказНаряд); КонецЕсли;
		КонецЕсли;
		
		КолвоЗаменено = ЗаменитьНоменклатуруВЗаказеПокупателя(Выборка);
		ЗаменитьНоменклатуруВЗаказНаряде(Выборка, КолвоЗаменено);
		ЗаменитьНоменклатуруВЗаказеПоставщику(Выборка, КолвоЗаменено);
	КонецЦикла;

	ВсеОК = ПровестиДокументыПослеЗамены();
	
	РазблокироватьЗаблокированныеДокументы();
	
	Возврат Новый Структура("ВсеОК, Информация", ВсеОК, ИнформацияПользователю);
	
КонецФункции

Функция ТекстЗапросаЗаменить()

	Возврат
		   "ВЫБРАТЬ
		   |	Таблица.НоменклатураИсточник,
		   |	Таблица.Номенклатура,
		   |	ВЫРАЗИТЬ(Таблица.ЗаказПоставщику КАК Документ.ЗаказПоставщику) КАК ЗаказПоставщику,
		   |	Таблица.КоличествоЗаменить,
		   |	Таблица.ЕдиницаИзмерения
		   |ПОМЕСТИТЬ ВТ_КЗамене
		   |ИЗ
		   |	&Таблица КАК Таблица
		   |ГДЕ
		   |	Таблица.КоличествоЗаменить > 0
		   |;
		   |
		   |////////////////////////////////////////////////////////////////////////////////
		   |ВЫБРАТЬ
		   |	ВЫРАЗИТЬ(ЗаказыРаспределениеОстатки.ЗаказПоставщика КАК Документ.ЗаказПоставщику) КАК ЗаказПоставщику,
		   |	ВЫРАЗИТЬ(ЗаказыРаспределениеОстатки.ЗаказПокупателя КАК Документ.ЗаказПокупателя) КАК ЗаказПокупателя,
		   |	ЗаказыРаспределениеОстатки.Номенклатура КАК Номенклатура,
		   |	ВТ_КЗамене.НоменклатураИсточник,
		   |	ВЫБОР
		   |		КОГДА ЕдиницыИзмерения.Коэффициент ЕСТЬ NULL 
		   |				ИЛИ ЕдиницыИзмерения.Коэффициент = 0
		   |			ТОГДА ЗаказыРаспределениеОстатки.КоличествоОстаток
		   |		ИНАЧЕ ЗаказыРаспределениеОстатки.КоличествоОстаток / ЕдиницыИзмерения.Коэффициент
		   |	КОНЕЦ КАК ОстатокРаспределение,
		   |	ВТ_КЗамене.КоличествоЗаменить,
		   |	ВТ_КЗамене.ЕдиницаИзмерения,
		   |	ЗаказыРаспределениеОстатки.ЗаказПокупателя.МоментВремени
		   |ПОМЕСТИТЬ ВТ_ОстаткиРаспределениеПодготовка
		   |ИЗ
		   |	РегистрНакопления.ЗаказыРаспределение.Остатки(
		   |			&Момент,
		   |			(ЗаказПоставщика, Номенклатура) В
		   |					(ВЫБРАТЬ
		   |						ВТ_КЗамене.ЗаказПоставщику,
		   |						ВТ_КЗамене.Номенклатура
		   |					ИЗ
		   |						ВТ_КЗамене КАК ВТ_КЗамене)
		   |				И ЗаказПокупателя ССЫЛКА Документ.ЗаказПокупателя) КАК ЗаказыРаспределениеОстатки
		   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КЗамене КАК ВТ_КЗамене
		   |		ПО ЗаказыРаспределениеОстатки.Номенклатура = ВТ_КЗамене.Номенклатура
		   |			И ЗаказыРаспределениеОстатки.ЗаказПоставщика = ВТ_КЗамене.ЗаказПоставщику
		   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
		   |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
		   |			ПО спрНоменклатура.ОсновнаяЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
		   |		ПО ЗаказыРаспределениеОстатки.Номенклатура = спрНоменклатура.Ссылка
		   |
		   |ИНДЕКСИРОВАТЬ ПО
		   |	Номенклатура
		   |;
		   |
		   |////////////////////////////////////////////////////////////////////////////////
		   |ВЫБРАТЬ
		   |	ВТ_ОстаткиРаспределение.ЗаказПоставщику,
		   |	ВТ_ОстаткиРаспределение.ЗаказПокупателя,
		   |	ВТ_ОстаткиРаспределение.Номенклатура,
		   |	ВТ_ОстаткиРаспределение.НоменклатураИсточник,
		   |	ВТ_ОстаткиРаспределение.ЕдиницаИзмерения,
		   |	МАКСИМУМ(ВТ_ОстаткиРаспределение.КоличествоЗаменить) КАК КоличествоЗаменить,
		   |	МАКСИМУМ(ВТ_ОстаткиРаспределение.ОстатокРаспределение) КАК ОстатокРаспределение,
		   |	СУММА(ЕСТЬNULL(ВТ_ОстаткиРаспределениеДО.ОстатокРаспределение, 0)) КАК ОстатокРаспределениеДО
		   |ПОМЕСТИТЬ ВТ_ОстаткиРаспределение
		   |ИЗ
		   |	ВТ_ОстаткиРаспределениеПодготовка КАК ВТ_ОстаткиРаспределение
		   |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиРаспределениеПодготовка КАК ВТ_ОстаткиРаспределениеДО
		   |		ПО ВТ_ОстаткиРаспределение.ЗаказПокупателяМоментВремени > ВТ_ОстаткиРаспределениеДО.ЗаказПокупателяМоментВремени
		   |			И ВТ_ОстаткиРаспределение.ЗаказПоставщику = ВТ_ОстаткиРаспределениеДО.ЗаказПоставщику
		   |			И ВТ_ОстаткиРаспределение.Номенклатура = ВТ_ОстаткиРаспределениеДО.Номенклатура
		   |
		   |СГРУППИРОВАТЬ ПО
		   |	ВТ_ОстаткиРаспределение.ЗаказПоставщику,
		   |	ВТ_ОстаткиРаспределение.ЗаказПокупателя,
		   |	ВТ_ОстаткиРаспределение.Номенклатура,
		   |	ВТ_ОстаткиРаспределение.НоменклатураИсточник,
		   |	ВТ_ОстаткиРаспределение.ЕдиницаИзмерения
		   |;
		   |
		   |////////////////////////////////////////////////////////////////////////////////
		   |ВЫБРАТЬ
		   |	ВТ_ОстаткиРаспределение.ЗаказПоставщику,
		   |	ВТ_ОстаткиРаспределение.ЗаказПокупателя,
		   |	ВТ_ОстаткиРаспределение.Номенклатура,
		   |	ВТ_ОстаткиРаспределение.НоменклатураИсточник,
		   |	ВЫБОР
		   |		КОГДА ВТ_ОстаткиРаспределение.ОстатокРаспределениеДО >= ВТ_ОстаткиРаспределение.КоличествоЗаменить
		   |			ТОГДА 0
		   |		КОГДА ВТ_ОстаткиРаспределение.ОстатокРаспределениеДО + ВТ_ОстаткиРаспределение.ОстатокРаспределение >= ВТ_ОстаткиРаспределение.КоличествоЗаменить
		   |			ТОГДА ВТ_ОстаткиРаспределение.КоличествоЗаменить - ВТ_ОстаткиРаспределение.ОстатокРаспределениеДО
		   |		КОГДА ВТ_ОстаткиРаспределение.ОстатокРаспределениеДО + ВТ_ОстаткиРаспределение.ОстатокРаспределение < ВТ_ОстаткиРаспределение.КоличествоЗаменить
		   |			ТОГДА ВТ_ОстаткиРаспределение.ОстатокРаспределение
		   |		ИНАЧЕ 0
		   |	КОНЕЦ КАК КоличествоЗаменить,
		   |	ВТ_ОстаткиРаспределение.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		   |ПОМЕСТИТЬ ВТ_Подготовка
		   |ИЗ
		   |	ВТ_ОстаткиРаспределение КАК ВТ_ОстаткиРаспределение
		   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		   |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
		   |			ПО СпрНоменклатура.ОсновнаяЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
		   |		ПО ВТ_ОстаткиРаспределение.Номенклатура = СпрНоменклатура.Ссылка
		   |;
		   |
		   |////////////////////////////////////////////////////////////////////////////////
		   |ВЫБРАТЬ
		   |	ВТ_Подготовка.ЗаказПоставщику КАК ЗаказПоставщику,
		   |	ВТ_Подготовка.ЗаказПокупателя КАК ЗаказПокупателя,
		   |	ВТ_Подготовка.Номенклатура,
		   |	ВТ_Подготовка.НоменклатураИсточник,
		   |	ВЫБОР
		   |		КОГДА ВТ_Подготовка.ЗаказПокупателя.ДокументОснование ССЫЛКА Документ.ЗаказНаряд
		   |			ТОГДА ВЫРАЗИТЬ(ВТ_Подготовка.ЗаказПокупателя.ДокументОснование КАК Документ.ЗаказНаряд)
		   |		КОГДА НЕ ЗаказНаряд.Ссылка ЕСТЬ NULL 
		   |			ТОГДА ЗаказНаряд.Ссылка
		   |		КОГДА НЕ Renault_CRM_ЗаявкаНаСервисСчетаНаОплату.Ссылка.ЗаказНаряд ЕСТЬ NULL 
		   |			ТОГДА Renault_CRM_ЗаявкаНаСервисСчетаНаОплату.Ссылка.ЗаказНаряд
		   |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка)
		   |	КОНЕЦ КАК ЗаказНаряд,
		   |	ВТ_Подготовка.ЕдиницаИзмерения,
		   |	ВТ_Подготовка.КоличествоЗаменить КАК Количество
		   |ПОМЕСТИТЬ ВТ_Итоговая
		   |ИЗ
		   |	ВТ_Подготовка КАК ВТ_Подготовка
		   |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд КАК ЗаказНаряд
		   |		ПО ВТ_Подготовка.ЗаказПокупателя = ЗаказНаряд.ДокументОснование
		   |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_CRM_ЗаявкаНаСервис.СчетаНаОплату КАК Renault_CRM_ЗаявкаНаСервисСчетаНаОплату
		   |		ПО ВТ_Подготовка.ЗаказПокупателя.ДокументОснование = Renault_CRM_ЗаявкаНаСервисСчетаНаОплату.СчетНаОплату
		   |ГДЕ
		   |	ВТ_Подготовка.КоличествоЗаменить > 0
		   |
		   |ИНДЕКСИРОВАТЬ ПО
		   |	ЗаказНаряд
		   |;
		   |
		   |////////////////////////////////////////////////////////////////////////////////
		   |ВЫБРАТЬ
		   |	ВТ_Итоговая.ЗаказПоставщику КАК ЗаказПоставщику,
		   |	ВТ_Итоговая.ЗаказПокупателя КАК ЗаказПокупателя,
		   |	ВТ_Итоговая.Номенклатура,
		   |	ВТ_Итоговая.НоменклатураИсточник,
		   |	МАКСИМУМ(ВЫБОР
		   |			КОГДА ДокЗаказНаряд.Ссылка ЕСТЬ NULL 
		   |				ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка)
		   |			ИНАЧЕ ВТ_Итоговая.ЗаказНаряд
		   |		КОНЕЦ) КАК ЗаказНаряд,
		   |	ВТ_Итоговая.ЕдиницаИзмерения,
		   |	МАКСИМУМ(ВТ_Итоговая.Количество) КАК Количество
		   |ИЗ
		   |	ВТ_Итоговая КАК ВТ_Итоговая
		   |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд КАК ДокЗаказНаряд
		   |		ПО ВТ_Итоговая.ЗаказНаряд = ДокЗаказНаряд.Ссылка
		   |			И (НЕ ДокЗаказНаряд.ПометкаУдаления)
		   |
		   |СГРУППИРОВАТЬ ПО
		   |	ВТ_Итоговая.ЕдиницаИзмерения,
		   |	ВТ_Итоговая.ЗаказПокупателя,
		   |	ВТ_Итоговая.Номенклатура,
		   |	ВТ_Итоговая.НоменклатураИсточник,
		   |	ВТ_Итоговая.ЗаказПоставщику
		   |
		   |УПОРЯДОЧИТЬ ПО
		   |	ЗаказПоставщику,
		   |	ЗаказПокупателя
		   |АВТОУПОРЯДОЧИВАНИЕ";

КонецФункции // ТекстЗапросаЗаменить()

Процедура РазблокироватьЗаблокированныеДокументы()

	Для каждого стр Из ИзмДок Цикл
		Об = стр.Документ;
		Попытка Об.Разблокировать(); Исключение КонецПопытки;
	КонецЦикла;	

	Попытка
		ДокПоступлениеОб.Разблокировать();
	Исключение
	КонецПопытки;

	ИзмДок = Неопределено;
	
КонецПроцедуры

Процедура ДобавитьВТаблицуИзмДок(ДокСсылка, ДокОб)

	Если Не ЗначениеЗаполнено(ДокСсылка) Тогда Возврат; КонецЕсли;
	
	Если ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Приоритет = 0;	
	ИначеЕсли ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Приоритет = 1;	
	Иначе
		Приоритет = 2;	
	КонецЕсли;
	
	НС = ИзмДок.Добавить();
	НС.ДокументСсылка = ДокСсылка;
	НС.Документ = ДокОб;
	НС.Приоритет = Приоритет;

КонецПроцедуры

Функция ПровестиДокументыПослеЗамены()

	//ЗаказНарядыСоотв = Новый Соответствие;
	
	Отказ = Ложь;
	Для каждого стр Из ИзмДок Цикл
			ДокОб = стр.Документ;
			Попытка 
				ДокОб.Заблокировать();
				//Если ТипЗнч(ДокОб) = Тип("СправочникОбъект.Renault_Advanced_ДанныеЗаказНаряда") Тогда
					// Заблокируем связанный типовой документ заказ-наряд
					обЗН = стр.ДокументСсылка.ПолучитьОбъект();
					обЗН.Заблокировать();
					
					// Заменим ссылку на объект
					//ЗаказНарядыСоотв.Вставить(стр.ДокументСсылка, обЗН);
				//КонецЕсли;
			Исключение 
				Отказ = Истина; ДобавитьИнформациюПользователю(ИнформацияОбОшибке(), стр.Документ, "Блокировка")
			КонецПопытки;
	КонецЦикла;	

	Попытка
		ДокПоступлениеОб.Заблокировать();
	Исключение
	 	ДобавитьИнформациюПользователю(ИнформацияОбОшибке(), Поступление, "Блокировка");
    	Отказ = Истина;
	КонецПопытки;
	
	ИзмДок.Сортировать("Приоритет");
	
	// Заказы поставщикам проводим в последнюю очередь
	Если Не Отказ Тогда
		НачатьТранзакцию();
		
		Для каждого стр Из ИзмДок Цикл
			Об = стр.Документ;
			Попытка
				Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Об.Ссылка)) Тогда
					Об.Записать(?(Об.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
				ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(Об.Ссылка)) Тогда
					Об.Записать();
					
					//Если ТипЗнч(Об) = Тип("СправочникОбъект.Renault_Advanced_ДанныеЗаказНаряда") Тогда
					//	// Записываем связанный документ
					//	обЗН = ЗаказНарядыСоотв.Получить(стр.ДокументСсылка);
					//	обЗН.Записать(?(обЗН.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
					//КонецЕсли;
				КонецЕсли;
			Исключение
				ДобавитьИнформациюПользователю(ИнформацияОбОшибке());
				ОтменитьТранзакцию();
				Возврат Ложь;
			КонецПопытки;
		КонецЦикла;	
		
		
		ДокПоступлениеОб.РаспределениеТовара.Свернуть("Номенклатура, ЗаказПоставщика, ЗаказПокупателя", "Количество");
		Попытка
			ДокПоступлениеОб.Записать(?(ДокПоступлениеОб.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
		Исключение
			ДобавитьИнформациюПользователю(ИнформацияОбОшибке());
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецПопытки;
		ЗафиксироватьТранзакцию();
		
		Для каждого стр Из ИзмДок Цикл ДобавитьИнформациюПользователю(Строка("Изменен документ: " + стр.ДокументСсылка)); КонецЦикла;
		ДобавитьИнформациюПользователю(Строка("Изменен документ: " + Поступление));
	КонецЕсли;
	
	Возврат Не Отказ;
	
КонецФункции

Процедура ДобавитьИнформациюПользователю(Информация, Источник = Неопределено, Событие = Неопределено)

	Если ТипЗнч(Информация) = Тип("ИнформацияОбОшибке") Тогда
		Информация = ПодробноеПредставлениеОшибки(Информация);
	КонецЕсли;
	
	Если Событие = "Блокировка" Тогда
		мСтрока = СтрПолучитьСтроку(Информация, 3);	
		ИмяПользователя = сред(Информация, Найти(Информация, "пользователь:")+14, (Найти(Информация, "сеанс:")-2) - (Найти(Информация, "пользователь:")+14));
		
		Информация = "Не удалось заблокировать объект: " + Источник + ". Объект заблокирован пользователем: " + ИмяПользователя;
	КонецЕсли;
	
	ИнформацияПользователю = ?(ПустаяСтрока(ИнформацияПользователю), Информация, ИнформацияПользователю + Символы.ПС + Информация);

КонецПроцедуры

Процедура ДобавитьИзмененнуюНоменклатуру(СтруктураПараметров)

	Если СтруктураПараметров.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент = 0 ИЛИ СтруктураПараметров.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент = NULL Тогда
		Коэффициент = 1;
	Иначе	
		Коэффициент = СтруктураПараметров.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент;
	КонецЕсли;
	
	НС = ДокПоступлениеОб.РаспределениеТовара.Добавить();	
	НС.ЗаказПоставщика =  СтруктураПараметров.ЗаказПоставщика;
	НС.ЗаказПокупателя =  СтруктураПараметров.ЗаказПокупателя;
	НС.Номенклатура =  СтруктураПараметров.Номенклатура;
	НС.Количество = СтруктураПараметров.Количество * Коэффициент;
	
	Строки = ДокПоступлениеОб.Товары.НайтиСтроки(Новый Структура("Номенклатура", НС.Номенклатура));
	Для каждого СтрокаТЧ Из Строки Цикл
		// Если способ распределение "Выборочное", то не меняем, иначе ставим "Выборочное и автоматическое"
		СтрокаТЧ.СпособРаспределения = ?(СтрокаТЧ.СпособРаспределения = 2, СтрокаТЧ.СпособРаспределения, 1);
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьОбъектЗаказНаряда(ЗаказНаряд)

	Если Не ЗначениеЗаполнено(ЗаказНаряд) Тогда Возврат Неопределено; КонецЕсли;
	
	обЗаказНаряд = ЗаказНаряд.ПолучитьОбъект();

	Возврат обЗаказНаряд;
	
КонецФункции // ПолучитьОбъектЗаказНаряда()

Функция ЗаменитьНоменклатуруВЗаказеПокупателя(Выборка)

	// Пересчитываемы реквизиты при делении строк
	РеквизитыЗаказ = Новый Структура("Сумма, СуммаСкидки, СуммаНДС, СуммаВсего, СуммаСкидкиСтроки");
	
	обЗаказПокупателя = ИзмДок.Найти(Выборка.ЗаказПокупателя, "ДокументСсылка").Документ;
	обЗаказПокупателя.БлокироватьПерерасчетСкидок = Истина;
	
	Строки = обЗаказПокупателя.Товары.НайтиСтроки(Новый Структура("Номенклатура", Выборка.Номенклатура));
	ОсталосьЗаменить = Выборка.Количество;
	КолвоЗаменено = 0;
	Для каждого СтрокаТовары Из Строки Цикл 
		Если СтрокаТовары.Количество <= СтрокаТовары.Резерв Тогда Продолжить; КонецЕсли;
		
		Если ОсталосьЗаменить = 0 Тогда Прервать; КонецЕсли;
		
		ВозможноЗаменить = СтрокаТовары.Количество - СтрокаТовары.Резерв;
		Если ВозможноЗаменить = ОсталосьЗаменить Тогда
			Если СтрокаТовары.Резерв > 0 Тогда ВывестиСтрокуСРезервом(обЗаказПокупателя, СтрокаТовары, РеквизитыЗаказ); КонецЕсли;
			
			ИзменитьНоменклатуруВСтрокеЗаказаПокупателя(СтрокаТовары, Выборка, обЗаказПокупателя.СкладКомпании);
			КолвоЗаменено = КолвоЗаменено + ОсталосьЗаменить;
			ДобавитьИзмененнуюНоменклатуру(Новый Структура("Номенклатура, ЗаказПоставщика, ЗаказПокупателя, Количество", Выборка.НоменклатураИсточник, Выборка.ЗаказПоставщику, Выборка.ЗаказПокупателя, ОсталосьЗаменить));
			ОсталосьЗаменить = 0;
		ИначеЕсли ВозможноЗаменить > ОсталосьЗаменить Тогда	
			// Нужно разбить строку	
			
			НоваяСтрока = обЗаказПокупателя.Товары.Добавить();
			НоваяСтрока.Количество = ОсталосьЗаменить;
			НоваяСтрока.ИдентификаторСтроки = Новый УникальныйИдентификатор;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары,, "ИдентификаторСтроки, Количество, Резерв");
			
			ИзменитьНоменклатуруВСтрокеЗаказаПокупателя(НоваяСтрока, Выборка, обЗаказПокупателя.СкладКомпании);
			
			КоэфИзм = СтрокаТовары.Количество / (ВозможноЗаменить + СтрокаТовары.Резерв - ОсталосьЗаменить);
			ПересчитатьСуммыПоКоэффициенту(РеквизитыЗаказ, СтрокаТовары, НоваяСтрока, КоэфИзм);
			СтрокаТовары.Количество = ВозможноЗаменить + СтрокаТовары.Резерв - ОсталосьЗаменить;
			
			КолвоЗаменено = КолвоЗаменено + ОсталосьЗаменить;
			ДобавитьИзмененнуюНоменклатуру(Новый Структура("Номенклатура, ЗаказПоставщика, ЗаказПокупателя, Количество", Выборка.НоменклатураИсточник, Выборка.ЗаказПоставщику, Выборка.ЗаказПокупателя, ОсталосьЗаменить));
			ОсталосьЗаменить = 0;
		ИначеЕсли ВозможноЗаменить > 0 И ВозможноЗаменить < ОсталосьЗаменить Тогда	
			Если СтрокаТовары.Резерв > 0 Тогда ВывестиСтрокуСРезервом(обЗаказПокупателя, СтрокаТовары, РеквизитыЗаказ); КонецЕсли;
			
			ИзменитьНоменклатуруВСтрокеЗаказаПокупателя(СтрокаТовары, Выборка, обЗаказПокупателя.СкладКомпании);
			ДобавитьИзмененнуюНоменклатуру(Новый Структура("Номенклатура, ЗаказПоставщика, ЗаказПокупателя, Количество", Выборка.НоменклатураИсточник, Выборка.ЗаказПоставщику, Выборка.ЗаказПокупателя, ВозможноЗаменить));
			КолвоЗаменено = КолвоЗаменено + ВозможноЗаменить;
			ОсталосьЗаменить = ОсталосьЗаменить - ВозможноЗаменить;
		Иначе
			Продолжить;	
		КонецЕсли;
	КонецЦикла;
	
	Строка = ИзмДок.Найти(Выборка.ЗаказПокупателя, "ДокументСсылка");
	Строка.Документ = обЗаказПокупателя;
	
	Возврат КолвоЗаменено;
	
КонецФункции

Функция ЗаменитьНоменклатуруВЗаказНаряде(Выборка, Знач КолвоЗаменено)
	
	Если Не ЗначениеЗаполнено(Выборка.ЗаказНаряд) Тогда Возврат Ложь; КонецЕсли;
	
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	Если Настройки.ИспользуетсяЗаказНарядRenault Тогда
		Возврат ЗаменитьНоменклатуруВЗаказНарядеRenault(Выборка, КолвоЗаменено);
	КонецЕсли;
	
	// Пересчитываемы реквизиты при делении строк
	РеквизитыЗаказ = Новый Структура("Сумма, СуммаСкидки, СуммаНДС, СуммаВсего, СуммаСкидкиСтроки");
	
	обЗаказНаряд = ИзмДок.Найти(Выборка.ЗаказНаряд, "ДокументСсылка").Документ;
	обЗаказНаряд.БлокироватьПерерасчетСкидок = Истина;
	
	Строки = обЗаказНаряд.Товары.НайтиСтроки(Новый Структура("Номенклатура", Выборка.Номенклатура));
	ОсталосьЗаменить = КолвоЗаменено;
	Для каждого СтрокаТовары Из Строки Цикл 
		Если ОсталосьЗаменить = 0 Тогда Прервать; КонецЕсли;
		
		ВозможноЗаменить = СтрокаТовары.Количество;
		Если ВозможноЗаменить = ОсталосьЗаменить Тогда
			ИзменитьНоменклатуруВСтрокеЗаказНаряде(СтрокаТовары, Выборка);
			ОсталосьЗаменить = 0;
		ИначеЕсли ВозможноЗаменить > ОсталосьЗаменить Тогда	
			// Нужно разбить строку	
			
			НоваяСтрока = обЗаказНаряд.Товары.Добавить();
			НоваяСтрока.Количество = ОсталосьЗаменить;
			НоваяСтрока.GUID = Новый УникальныйИдентификатор;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары,, "Количество, GUID");
			
			ИзменитьНоменклатуруВСтрокеЗаказНаряде(НоваяСтрока, Выборка);
			
			КоэфИзм = СтрокаТовары.Количество / (ВозможноЗаменить - ОсталосьЗаменить);
			ПересчитатьСуммыПоКоэффициенту(РеквизитыЗаказ, СтрокаТовары, НоваяСтрока, КоэфИзм);
			СтрокаТовары.Количество = ВозможноЗаменить - ОсталосьЗаменить;
			
			ОсталосьЗаменить = 0;
		ИначеЕсли ВозможноЗаменить > 0 И ВозможноЗаменить < ОсталосьЗаменить Тогда	
			ИзменитьНоменклатуруВСтрокеЗаказНаряде(СтрокаТовары, Выборка);
			ОсталосьЗаменить = ОсталосьЗаменить - ВозможноЗаменить;
		Иначе
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	
	Строка = ИзмДок.Найти(Выборка.ЗаказНаряд, "ДокументСсылка");
	Строка.Документ = обЗаказНаряд;
	
КонецФункции

Функция ЗаменитьНоменклатуруВЗаказНарядеRenault(Выборка, КолвоЗаменено)


	
КонецФункции 

Функция ЗаменитьНоменклатуруВЗаказеПоставщику(Выборка, КолвоЗаменить)
	
	// Пересчитываемы реквизиты при делении строк
	РеквизитыЗаказ = Новый Структура("Сумма, СуммаНДС, СуммаВсего");
	
	обЗаказПоставщику = ИзмДок.Найти(Выборка.ЗаказПоставщику, "ДокументСсылка").Документ;
	
	обЗаказПоставщику.Товары.Свернуть(ПолучитьКолонкиГруппировок(обЗаказПоставщику.Ссылка, "Товары", Новый Структура("Коэффициент,Цена"), Новый Структура("ПримечаниеНоменклатура")), 
									  ПолучитьКолонкиСуммирования(обЗаказПоставщику.Ссылка, "Товары",, Новый Структура("Коэффициент,Цена, Распределено")));
	
	// 1. Заменяем в ТЧ "РаспределениеЗаказа"
	
	обЗаказПоставщику.РаспределениеЗаказа.Свернуть(ПолучитьКолонкиГруппировок(обЗаказПоставщику.Ссылка, "РаспределениеЗаказа", Новый Структура("Коэффициент,Цена")), 
									  			   ПолучитьКолонкиСуммирования(обЗаказПоставщику.Ссылка, "РаспределениеЗаказа",, Новый Структура("Коэффициент,Цена")));
	
	Строки = обЗаказПоставщику.РаспределениеЗаказа.НайтиСтроки(Новый Структура("Номенклатура, ЗаказПокупателя", Выборка.Номенклатура, Выборка.ЗаказПокупателя));
	ОсталосьЗаменить = КолвоЗаменить;
	КолвоЗаменено = 0;
	Для каждого СтрокаТовары Из Строки Цикл 
		Если СтрокаТовары.Количество = 0 Тогда Продолжить; КонецЕсли;
		
		Если ОсталосьЗаменить = 0 Тогда Прервать; КонецЕсли;
		
		ВозможноЗаменить = СтрокаТовары.Количество;
		Если СтрокаТовары.Количество = ОсталосьЗаменить Тогда
			ИзменитьНоменклатуруВСтрокеЗаказаПоставщику(СтрокаТовары, Выборка, "РаспределениеЗаказа");
			КолвоЗаменено = КолвоЗаменено + ОсталосьЗаменить;
			ОсталосьЗаменить = 0;
		ИначеЕсли СтрокаТовары.Количество > ОсталосьЗаменить Тогда	
			// Нужно разбить строку	
			
			НоваяСтрока = обЗаказПоставщику.РаспределениеЗаказа.Добавить();
			НоваяСтрока.Количество = ОсталосьЗаменить;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары,, "Количество");
			
			ИзменитьНоменклатуруВСтрокеЗаказаПоставщику(НоваяСтрока, Выборка, "РаспределениеЗаказа");
			
			СтрокаТовары.Количество = СтрокаТовары.Количество - ОсталосьЗаменить;
			
			КолвоЗаменено = КолвоЗаменено + ОсталосьЗаменить;
			ОсталосьЗаменить = 0;
		ИначеЕсли СтрокаТовары.Количество > 0 И СтрокаТовары.Распределено < ОсталосьЗаменить Тогда	
			ИзменитьНоменклатуруВСтрокеЗаказаПоставщику(СтрокаТовары, Выборка, "РаспределениеЗаказа");
			КолвоЗаменено = КолвоЗаменено + ВозможноЗаменить;
			ОсталосьЗаменить = ОсталосьЗаменить - ВозможноЗаменить;
		Иначе
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	обЗаказПоставщику.РаспределениеЗаказа.Свернуть(ПолучитьКолонкиГруппировок(обЗаказПоставщику.Ссылка, "РаспределениеЗаказа", Новый Структура("Коэффициент,Цена"), Новый Структура("ПримечаниеНоменклатура")), 
									  			   ПолучитьКолонкиСуммирования(обЗаказПоставщику.Ссылка, "РаспределениеЗаказа",, Новый Структура("Коэффициент,Цена")));
	
	Массив = Новый Массив;
	Массив.Добавить(Выборка.Номенклатура);
	Массив.Добавить(Выборка.НоменклатураИсточник);
	ПерезаполнитьКолвоРаспределеноТЧТовары_ЗаказПоставщику(обЗаказПоставщику, Массив);
	
	// 2. Заменяем в ТЧ "Товары"		
	
	Строки = обЗаказПоставщику.Товары.НайтиСтроки(Новый Структура("Номенклатура", Выборка.Номенклатура));
	ОсталосьЗаменить = КолвоЗаменено;
	ТоварВТЧ = обЗаказПоставщику.Товары.Найти(Выборка.Номенклатура, "Номенклатура") <> Неопределено;
	Для каждого СтрокаТовары Из Строки Цикл 
		Если ОсталосьЗаменить = 0 Тогда Прервать; КонецЕсли;
		
		ВозможноЗаменить = СтрокаТовары.Количество - СтрокаТовары.Распределено;
		Если ВозможноЗаменить = ОсталосьЗаменить Тогда           
			Если СтрокаТовары.Распределено > 0 Тогда ВывестиСтрокуРаспределено(обЗаказПоставщику, СтрокаТовары, РеквизитыЗаказ) КонецЕсли;
			ИзменитьНоменклатуруВСтрокеЗаказаПоставщику(СтрокаТовары, Выборка, "Товары");
			СтрокаТовары.Распределено = ?(ТоварВТЧ, 0, ОсталосьЗаменить);
			ОсталосьЗаменить = 0;
		ИначеЕсли ВозможноЗаменить > ОсталосьЗаменить Тогда	
			// Нужно разбить строку	
			
						
			НоваяСтрока = обЗаказПоставщику.Товары.Добавить();
			НоваяСтрока.Количество = ОсталосьЗаменить;
			НоваяСтрока.Распределено = ?(ТоварВТЧ, 0, ОсталосьЗаменить); // количество "распределено" уже заполнено на этапе 1

			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары,, "Количество, Распределено");
			
			ИзменитьНоменклатуруВСтрокеЗаказаПоставщику(НоваяСтрока, Выборка, "Товары");
			
			КоэфИзм = СтрокаТовары.Количество / (СтрокаТовары.Количество - ОсталосьЗаменить);
			ПересчитатьСуммыПоКоэффициенту(РеквизитыЗаказ, СтрокаТовары, НоваяСтрока, КоэфИзм);
			СтрокаТовары.Количество = СтрокаТовары.Количество - ОсталосьЗаменить;
			
			ОсталосьЗаменить = 0;
		ИначеЕсли ВозможноЗаменить > 0 И ВозможноЗаменить < ОсталосьЗаменить Тогда	
			Если СтрокаТовары.Распределено > 0 Тогда ВывестиСтрокуРаспределено(обЗаказПоставщику, СтрокаТовары, РеквизитыЗаказ) КонецЕсли;
			ИзменитьНоменклатуруВСтрокеЗаказаПоставщику(СтрокаТовары, Выборка, "Товары");
			СтрокаТовары.Распределено = ?(ТоварВТЧ, 0, СтрокаТовары.Количество);
			ОсталосьЗаменить = ОсталосьЗаменить - ВозможноЗаменить;
		Иначе
			Продолжить;	
		КонецЕсли;
	КонецЦикла;
	
	обЗаказПоставщику.Товары.Свернуть(ПолучитьКолонкиГруппировок(обЗаказПоставщику.Ссылка, "Товары", Новый Структура("Коэффициент,Цена")), 
									  ПолучитьКолонкиСуммирования(обЗаказПоставщику.Ссылка, "Товары",, Новый Структура("Коэффициент,Цена")));
	
	ПерезаполнитьКолвоРаспределеноТЧТовары_ЗаказПоставщику(обЗаказПоставщику);
									  
	Строка = ИзмДок.Найти(Выборка.ЗаказПоставщику, "ДокументСсылка");
	Строка.Документ = обЗаказПоставщику;
	
КонецФункции

Процедура ПерезаполнитьКолвоРаспределеноТЧТовары_ЗаказПоставщику(обЗаказПоставщику, СписокНоменклатуры = Неопределено)

	Если СписокНоменклатуры = Неопределено Тогда СписокНоменклатуры = обЗаказПоставщику.Товары.Выгрузить().ВыгрузитьКолонку("Номенклатура"); КонецЕсли;
	
	Для каждого Номенклатура Из СписокНоменклатуры Цикл
		
		// 1. Получим общее количество распределенное по номенклатуре
		// Перед тем как вносим колво распределено - свернули ТЧ товары по номенклатуре
		КолвоРаспределено = 0;
		Строки = обЗаказПоставщику.РаспределениеЗаказа.НайтиСтроки(Новый Структура("Номенклатура", Номенклатура));
		Для каждого СтрокаТЧ Из Строки Цикл КолвоРаспределено = КолвоРаспределено + СтрокаТЧ.Количество КонецЦикла;
		
		Строки = обЗаказПоставщику.Товары.НайтиСтроки(Новый Структура("Номенклатура", Номенклатура));
		Для каждого СтрокаТЧ Из Строки Цикл СтрокаТЧ.Распределено = КолвоРаспределено КонецЦикла;
	КонецЦикла;

КонецПроцедуры

Процедура ИзменитьНоменклатуруВСтрокеЗаказаПокупателя(СтрокаТовары, СтрокаДанных, СкладКомпании)
	СтрокаТовары.Номенклатура     = СтрокаДанных.НоменклатураИсточник;
	СтрокаТовары.ЕдиницаИзмерения = СтрокаДанных.ЕдиницаИзмерения;
	СтрокаТовары.Коэффициент      =	СтрокаДанных.ЕдиницаИзмерения.Коэффициент;
	СтрокаТовары.Производитель 	  =	СтрокаДанных.НоменклатураИсточник.Производитель;
	СтрокаТовары.Ячейка           = СтрокаДанных.НоменклатураИсточник.ПолучитьОбъект().ПолучитьЯчейкуХранения(СкладКомпании);
	СтрокаТовары.ХарактеристикаНоменклатуры     = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
КонецПроцедуры

Процедура ИзменитьНоменклатуруВСтрокеЗаказНаряде(СтрокаТовары, СтрокаДанных)

	СтрокаТовары.Номенклатура     = СтрокаДанных.НоменклатураИсточник;
	СтрокаТовары.ЕдиницаИзмерения = СтрокаДанных.ЕдиницаИзмерения;
	СтрокаТовары.Коэффициент      =	СтрокаДанных.ЕдиницаИзмерения.Коэффициент;
	СтрокаТовары.ХарактеристикаНоменклатуры     = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();

КонецПроцедуры

Процедура ИзменитьНоменклатуруВСтрокеЗаказаПоставщику(СтрокаТовары, СтрокаДанных, ИмяТЧ)
	СтрокаТовары.Номенклатура     = СтрокаДанных.НоменклатураИсточник;
	СтрокаТовары.ЕдиницаИзмерения = СтрокаДанных.ЕдиницаИзмерения;
	СтрокаТовары.Коэффициент      =	СтрокаДанных.ЕдиницаИзмерения.Коэффициент;
	СтрокаТовары.ХарактеристикаНоменклатуры     = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
КонецПроцедуры

// Выводит количество (распределено) в отдельную строку
Функция ВывестиСтрокуРаспределено(обЗаказПоставщика, СтрокаИсходная, РеквизитыЗаказ)

	// Выносим количество распределено в отдельную строку
	СтрокаРаспределено = обЗаказПоставщика.Товары.Добавить();
	СтрокаРаспределено.Количество = СтрокаИсходная.Распределено;
	ЗаполнитьЗначенияСвойств(СтрокаРаспределено, СтрокаИсходная,, "Количество");
	
	КоэфИзм = СтрокаИсходная.Количество / (СтрокаИсходная.Количество - СтрокаИсходная.Распределено);
	ПересчитатьСуммыПоКоэффициенту(РеквизитыЗаказ, СтрокаИсходная, СтрокаРаспределено, КоэфИзм);
	СтрокаИсходная.Количество = СтрокаИсходная.Количество - СтрокаИсходная.Распределено;
	СтрокаИсходная.Распределено = 0;

	Возврат СтрокаРаспределено;
	
КонецФункции

// Выводит количество (резерв) в отдельную строку
Процедура ВывестиСтрокуСРезервом(обЗаказПокупателя, СтрокаИсходная, РеквизитыЗаказ)

	// Выносим количество с резервом в отдельную строку
	СтрокаРезерв = обЗаказПокупателя.Товары.Добавить();
	СтрокаРезерв.Количество = СтрокаРезерв.Резерв;
	ЗаполнитьЗначенияСвойств(СтрокаРезерв, СтрокаИсходная,, "Количество");
	
	КоэфИзм = СтрокаИсходная.Количество / (СтрокаИсходная.Количество - СтрокаИсходная.Резерв);
	ПересчитатьСуммыПоКоэффициенту(РеквизитыЗаказ, СтрокаИсходная, СтрокаРезерв, КоэфИзм);
	СтрокаИсходная.Количество = СтрокаИсходная.Количество - СтрокаИсходная.Резерв;
	СтрокаИсходная.Резерв = 0;
	СтрокаИсходная.ИдентификаторСтроки = Новый УникальныйИдентификатор;

КонецПроцедуры

Процедура ПересчитатьСуммыПоКоэффициенту(СтруктураРеквизитов, ИсходнаяСтрока, НоваяСтрока, Коэффициент)

	// Пересчитываем суммы
	Для каждого КлючЗначение Из СтруктураРеквизитов Цикл
		ИмяРеквизита = КлючЗначение.Ключ;
		ИсходнаяСтрока[ИмяРеквизита] = ИсходнаяСтрока[ИмяРеквизита] / Коэффициент;
		НоваяСтрока[ИмяРеквизита] = НоваяСтрока[ИмяРеквизита] - ИсходнаяСтрока[ИмяРеквизита];
	КонецЦикла;
	
КонецПроцедуры

Функция ДеревоВТЗ(ДЗ)

	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("НоменклатураИсточник", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Для каждого Колонка Из ДЗ.Колонки Цикл
		ТЗ.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;

	ДеревоВТЗ_Рекурсия(ДЗ.Строки, ТЗ);

	Возврат ТЗ;
	
КонецФункции

Процедура ДеревоВТЗ_Рекурсия(СтрокиДЗ, ТЗ)

	Если СтрокиДЗ.Количество() = 0 Тогда Возврат; КонецЕсли;

	Для каждого СтрокаДЗ Из СтрокиДЗ Цикл
		Если СтрокаДЗ.Строки.Количество() = 0 Тогда 
			НС_ТЗ = ТЗ.Добавить();
			НС_ТЗ.НоменклатураИсточник = СтрокаДЗ.Родитель.Номенклатура;
			НС_ТЗ.ЕдиницаИзмерения = СтрокаДЗ.Родитель.ЕдиницаИзмерения;
			ЗаполнитьЗначенияСвойств(НС_ТЗ, СтрокаДЗ,, "ЕдиницаИзмерения"); 
		КонецЕсли;	
		
	    ДеревоВТЗ_Рекурсия(СтрокаДЗ.Строки, ТЗ);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьКолонкиГруппировок(Ссылка, ИмяТЧ, ИслючениеДобавить = Неопределено, ИключениеИсключить = Неопределено)

	// Выбираем все реквизиты ТЧ, кроме числовых
	
	Если ИслючениеДобавить = Неопределено Тогда ИслючениеДобавить = Новый Структура; КонецЕсли;
	Если ИключениеИсключить = Неопределено Тогда ИключениеИсключить = Новый Структура; КонецЕсли;
	
	КолонкиГруппировок = "";
	Для каждого Реквизит Из Ссылка.Метаданные().ТабличныеЧасти[ИмяТЧ].Реквизиты Цикл

		Если ИключениеИсключить.Свойство(Реквизит.Имя) Тогда Продолжить; КонецЕсли; // игнорируем в любом случае
		Если ИслючениеДобавить.Свойство(Реквизит.Имя) Тогда ЭтоИсключение = Истина; Иначе ЭтоИсключение = Ложь; КонецЕсли; // добавляем в любом случае
		Если Не ЭтоИсключение И Реквизит.Тип.СодержитТип(Тип("Число")) И Реквизит.Тип.Типы().Количество() = 1 Тогда Продолжить; КонецЕсли;
		
		КолонкиГруппировок = ?(ПустаяСтрока(КолонкиГруппировок), Реквизит.Имя, КолонкиГруппировок + ", " + Реквизит.Имя);
	КонецЦикла;

	Возврат КолонкиГруппировок;
	
КонецФункции // ПолучитьКолонкиГруппировок()

Функция ПолучитьКолонкиСуммирования(Ссылка, ИмяТЧ, ИслючениеДобавить = Неопределено, ИключениеИсключить = Неопределено)

	// Выбираем все числовые реквизиты ТЧ
	
	Если ИслючениеДобавить = Неопределено Тогда ИслючениеДобавить = Новый Структура; КонецЕсли;
	Если ИключениеИсключить = Неопределено Тогда ИключениеИсключить = Новый Структура; КонецЕсли;
	
	КолонкиГруппировок = "";
	Для каждого Реквизит Из Ссылка.Метаданные().ТабличныеЧасти[ИмяТЧ].Реквизиты Цикл
		
		Если ИключениеИсключить.Свойство(Реквизит.Имя) Тогда Продолжить; КонецЕсли; // игнорируем в любом случае
		Если ИслючениеДобавить.Свойство(Реквизит.Имя) Тогда ЭтоИсключение = Истина; Иначе ЭтоИсключение = Ложь; КонецЕсли; // добавляем в любом случае
		Если Не ЭтоИсключение И Реквизит.Тип.Типы().Количество() > 1 Тогда Продолжить; КонецЕсли; // не выбираем составные типы
		Если Не ЭтоИсключение И Не Реквизит.Тип.СодержитТип(Тип("Число")) Тогда Продолжить; КонецЕсли;
		
		КолонкиГруппировок = ?(ПустаяСтрока(КолонкиГруппировок), Реквизит.Имя, КолонкиГруппировок + ", " + Реквизит.Имя);
	КонецЦикла;

	Возврат КолонкиГруппировок;

КонецФункции // ПолучитьКолонкиСуммирования()
